app/controllers/refinery/blog/posts_controller.rb

      def tagged
        @tag = ActsAsTaggableOn::Tag.find(params[:tag_id])
---
SELECT  "tags".* FROM "tags"  WHERE "tags"."id" = $1 LIMIT 1  [["id", 1]]